src/Enums/ТипыПоставки/ТипыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоставки</name>
  <enumValues>
    <name>Обычная</name>
  </enumValues>
  <enumValues>
    <name>Длительная</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВидыКонфигураций/ВидыКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонфигураций</name>
  <predefined>
    <items>
      <name>БухгалтерияПредприятия</name>
      <description>БухгалтерияПредприятия</description>
    </items>
    <items>
      <name>БухгалтерияПредприятияКОРП</name>
      <description>БухгалтерияПредприятияКОРП</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналом</name>
      <description>ЗарплатаИУправлениеПерсоналом</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналомКОРП</name>
      <description>ЗарплатаИУправлениеПерсоналомКОРП</description>
    </items>
    <items>
      <name>Метрология</name>
      <description>Метрология</description>
    </items>
    <items>
      <name>ОхранаОкружающейСреды</name>
      <description>Охрана окружающей среды</description>
    </items>
    <items>
      <name>УправлениеНСИ</name>
      <description>Управление НСИ</description>
    </items>
    <items>
      <name>УправлениеУчебнымЦентром</name>
      <description>Управление учебным центром</description>
    </items>
    <items>
      <name>УправлениеПредприятием</name>
      <description>Управление холдингом</description>
    </items>
    <items>
      <name>УправлениеХолдингом</name>
      <description>УправлениеХолдингом</description>
    </items>
    <items>
      <name>УправлениеХолдингомERP</name>
      <description>УправлениеХолдингомERP</description>
    </items>
  </predefined>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВерсииКонфигураций/ВерсииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииКонфигураций</name>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>CatalogRef.РедакцииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РелизОтозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/РедакцииКонфигураций/РедакцииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РедакцииКонфигураций</name>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрВерсий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/СервисОбновлений1С/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗапуститьОбновлениеВерсийКонфигураций1С() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыКонфигураций.Ссылка КАК ВидКонфигурации,
		|	ВидыКонфигураций.КодПрограммы КАК КодПрограммы
		|ИЗ
		|	Справочник.ВидыКонфигураций КАК ВидыКонфигураций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииКонфигураций КАК ВерсииКонфигураций
		|		ПО ВидыКонфигураций.Ссылка = ВерсииКонфигураций.ВидКонфигурации
		|ГДЕ
		|	НЕ ВидыКонфигураций.ПометкаУдаления
		|	И НЕ ВерсииКонфигураций.ПометкаУдаления
		|	И НЕ ВерсииКонфигураций.РелизОтозван";
	
	ВыборкаВидов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаВидов.Следующий() Цикл
		Попытка
			ОбработатьВидКонфигурации(ВыборкаВидов.ВидКонфигурации, ВыборкаВидов.КодПрограммы);
			ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Информация, 
				ВыборкаВидов.ВидКонфигурации, 
				"Обработка вида конфигурации завершена успешно: " + ВыборкаВидов.КодПрограммы);
		Исключение
			ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Ошибка, 
				ВыборкаВидов.ВидКонфигурации, 
				"Ошибка обработки вида конфигурации " + ВыборкаВидов.КодПрограммы + ": " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗапуститьОбновлениеВерсииПлатформы1С() Экспорт
	
	Попытка
		ОбработатьПлатформу();
		ЗаписатьЛогВерсииКонфигПлатформы(УровеньЖурналаРегистрации.Информация, 
			"Обработка платформы завершена успешно");
	Исключение
		ЗаписатьЛогВерсииКонфигПлатформы(УровеньЖурналаРегистрации.Ошибка, 
			"Ошибка обработки платформы: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьВидКонфигурации(ВидКонфигурации, КодПрограммы)
	
	ЗапросРедакций = Новый Запрос;
	ЗапросРедакций.Текст =
		"ВЫБРАТЬ
		|	РедакцииКонфигураций.Ссылка КАК Редакция,
		|	РедакцииКонфигураций.ФильтрВерсий КАК ФильтрВерсий
		|ИЗ
		|	Справочник.РедакцииКонфигураций КАК РедакцииКонфигураций
		|ГДЕ
		|	РедакцииКонфигураций.ВидКонфигурации = &ВидКонфигурации
		|	И НЕ РедакцииКонфигураций.ПометкаУдаления
		|	И РедакцииКонфигураций.Активна";
	ЗапросРедакций.УстановитьПараметр("ВидКонфигурации", ВидКонфигурации);
	
	ВыборкаРедакций = ЗапросРедакций.Выполнить().Выбрать();
	
	Если ВыборкаРедакций.Количество() = 0 Тогда
		ОбновитьВерсиюКонфигурации(ВидКонфигурации, Неопределено, КодПрограммы, "");
	Иначе
		Пока ВыборкаРедакций.Следующий() Цикл
			ОбновитьВерсиюКонфигурации(ВидКонфигурации, ВыборкаРедакций.Редакция, КодПрограммы, ВыборкаРедакций.ФильтрВерсий);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВерсиюКонфигурации(ВидКонфигурации, Редакция, КодПрограммы, ФильтрВерсий)
	
	ТекущаяВерсия = ВерсииКонфигураций.НомерАктуальной(ВидКонфигурации, Редакция);
	Если Не ЗначениеЗаполнено(ТекущаяВерсия) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ПолучитьДанныеОбновленияКонфигурации(КодПрограммы, ТекущаяВерсия);
	Если Не РезультатЗапроса.Успех Тогда
		ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Ошибка, 
			?(ЗначениеЗаполнено(Редакция), Редакция, ВидКонфигурации),
			"Ошибка запроса обновления для " + КодПрограммы + ": " + РезультатЗапроса.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	НоваяВерсия = РезультатЗапроса.НоваяВерсия;
	// КРУ Пастушенко А.А. УИТ №85567 ++
	Если Редакция <> Неопределено И РезультатЗапроса.Свойство("ДанныеКонфигурацииДлительнойПоддержки")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Редакция, "ТипПоставки") = Перечисления.ТипыПоставки.Длительная Тогда
			
			ДанныеКонфигурацииДлительнойПоддержки = РезультатЗапроса.ДанныеКонфигурацииДлительнойПоддержки;
			НоваяВерсия = ДанныеКонфигурацииДлительнойПоддержки["configurationVersion"];
			РезультатЗапроса.URLИнфо = ДанныеКонфигурацииДлительнойПоддержки["updateInfoUrl"];
			
	КонецЕсли;
	// КРУ Пастушенко А.А. --
	Если Не ЗначениеЗаполнено(НоваяВерсия) Тогда
		ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Предупреждение, 
			?(ЗначениеЗаполнено(Редакция), Редакция, ВидКонфигурации),
			"Версия не изменилась для " + КодПрограммы + ". Текущая: " + ТекущаяВерсия);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрВерсий) И Не ВерсииКонфигураций.СоответствуетФильтруВерсий(НоваяВерсия, ФильтрВерсий) Тогда
		ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Предупреждение, 
			Редакция,
			"Новая версия не соответствует фильтру редакции для " + КодПрограммы + ". Фильтр: " + ФильтрВерсий + ", Версия: " + НоваяВерсия);
		Возврат;
	КонецЕсли;
	
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсия, НоваяВерсия) >= 0 Тогда
		ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Предупреждение, 
			?(ЗначениеЗаполнено(Редакция), Редакция, ВидКонфигурации),
			"Новая версия не больше текущей для " + КодПрограммы + ". Текущая: " + ТекущаяВерсия + ", Новая: " + НоваяВерсия);
		Возврат;
	КонецЕсли;
	
	ВерсииКонфигураций.СоздатьЭлемент(ВидКонфигурации, НоваяВерсия, Редакция, РезультатЗапроса.URLИнфо);
	
	ЗаписатьЛогВерсииКонфиг(УровеньЖурналаРегистрации.Информация, 
		?(ЗначениеЗаполнено(Редакция), Редакция, ВидКонфигурации),
		"Создана новая версия для " + КодПрограммы + ": " + НоваяВерсия);
	
КонецПроцедуры

Функция ПолучитьДанныеОбновленияКонфигурации(КодПрограммы, ТекущаяВерсия)
	
	Результат = Новый Структура("Успех, НоваяВерсия, URLИнфо, ТекстОшибки", Ложь, "", "", "");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсияПлатформы = ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииБезНомераСборки(СистемнаяИнформация.ВерсияПриложения);
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("programName", КодПрограммы);
	ДанныеЗапроса.Вставить("versionNumber", ТекущаяВерсия);
	ДанныеЗапроса.Вставить("platformVersion", ТекущаяВерсияПлатформы);
	ДанныеЗапроса.Вставить("programNewName", "");
	ДанныеЗапроса.Вставить("redactionNumber", "");
	ДанныеЗапроса.Вставить("updateType", "NewConfigurationAndOrPlatform");
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Таймаут = 30;
	ДополнительныеПараметры.ПроверятьSSL = Истина;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	Попытка
		Ответ = КоннекторHTTP.PostJson("https://update-api.1c.ru/update-platform/programs/update/info", 
									ДанныеЗапроса, 
									ДополнительныеПараметры);
		
		Если ТипЗнч(Ответ) <> Тип("Соответствие") Тогда
			Результат.ТекстОшибки = "Некорректный формат ответа сервера.";
			УстановитьОтключениеБезопасногоРежима(Ложь);
			Возврат Результат;
		КонецЕсли;
		
		Ошибка = Ответ.Получить("error");
		Если Ошибка <> Неопределено Тогда
			Результат.ТекстОшибки = СформироватьТекстОшибкиAPI(Ответ);
			УстановитьОтключениеБезопасногоРежима(Ложь);
			Возврат Результат;
		КонецЕсли;
		
		Конфигурация = Ответ.Получить("configurationUpdateResponse");
		Если Конфигурация = Неопределено Тогда
			Результат.ТекстОшибки = "Данные об обновлении конфигурации не получены.";
			Возврат Результат;
		КонецЕсли;
		
		НоваяВерсия = Конфигурация.Получить("configurationVersion");
		Если НоваяВерсия <> Неопределено Тогда
			Результат.НоваяВерсия = Строка(НоваяВерсия);
		КонецЕсли;
		
		URLИнфо = Конфигурация.Получить("updateInfoUrl");
		Если URLИнфо <> Неопределено Тогда
			Результат.URLИнфо = URLИнфо;
		КонецЕсли;
		
		// КРУ Пастушенко А.А. УИТ Заявка №85567 ++
		Если Ответ.Получить("additionalReleaseUpdate") <> Неопределено И ТипЗнч(Ответ["additionalReleaseUpdate"]) = Тип("Массив")
		И Ответ["additionalReleaseUpdate"].Количество() Тогда
		
			additionalReleaseUpdate = Ответ["additionalReleaseUpdate"].Получить(Ответ["additionalReleaseUpdate"].ВГраница());
			ДанныеКонфигурацииДлительнойПоддержки = additionalReleaseUpdate["configurationUpdate"];
			
			Результат.Вставить("ДанныеКонфигурацииДлительнойПоддержки", ДанныеКонфигурацииДлительнойПоддержки);
			
		КонецЕсли;
		// КРУ Пастушенко А.А. --
		
		Результат.Успех = Истина; 
		
	Исключение
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	УстановитьОтключениеБезопасногоРежима(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьЛогВерсииКонфиг(Уровень, ОбъектМетаданных, ТекстСообщения)
	
	ЗаписьЖурналаРегистрации("СинхронизацияВерсийКонфигураций1С", Уровень, , ОбъектМетаданных, ТекстСообщения);
	
КонецПроцедуры


Процедура ОбработатьПлатформу()
	
	ТекущаяВерсия = ВерсииТехнологическойПлатформы.НомерАктуальной();
	Если Не ЗначениеЗаполнено(ТекущаяВерсия) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ПолучитьДанныеОбновленияПлатформы(ТекущаяВерсия);
	Если Не РезультатЗапроса.Успех Тогда
		ЗаписатьЛогВерсииКонфигПлатформы(УровеньЖурналаРегистрации.Ошибка, 
			"Ошибка запроса обновления для платформы: " + РезультатЗапроса.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	НоваяВерсия = РезультатЗапроса.НоваяВерсия;
	Если Не ЗначениеЗаполнено(НоваяВерсия) Тогда
		ЗаписатьЛогВерсииКонфигПлатформы(УровеньЖурналаРегистрации.Предупреждение, 
			"Версия не изменилась для платформы. Текущая: " + ТекущаяВерсия);
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсия, НоваяВерсия) >= 0 Тогда
		ЗаписатьЛогВерсииКонфигПлатформы(УровеньЖурналаРегистрации.Предупреждение, 
			"Новая версия не больше текущей для платформы. Текущая: " + ТекущаяВерсия + ", Новая: " + НоваяВерсия);
		Возврат;
	КонецЕсли;
	
	ВерсииТехнологическойПлатформы.СоздатьЭлемент(НоваяВерсия, РезультатЗапроса.URLИнфо);
	
	ЗаписатьЛогВерсииКонфигПлатформы(УровеньЖурналаРегистрации.Информация, 
		"Создана новая версия для платформы: " + НоваяВерсия);
	
КонецПроцедуры

Функция ПолучитьДанныеОбновленияПлатформы(ТекущаяВерсия)
	
	БП = Справочники.ВидыКонфигураций.БухгалтерияПредприятия;	
	
	Результат = Новый Структура("Успех, НоваяВерсия, URLИнфо, ТекстОшибки", Ложь, "", "", "");
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("programName", БП.КодПрограммы); // Без этого сервис не работает
	ДанныеЗапроса.Вставить("versionNumber", ВерсииКонфигураций.НомерАктуальной(БП)); // Без этого сервис не работает
	ДанныеЗапроса.Вставить("platformVersion", ТекущаяВерсия);
	ДанныеЗапроса.Вставить("programNewName", "");
	ДанныеЗапроса.Вставить("redactionNumber", "");
	ДанныеЗапроса.Вставить("updateType", "NewPlatform");
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Таймаут = 30;
	ДополнительныеПараметры.ПроверятьSSL = Истина;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	Попытка
		Ответ = КоннекторHTTP.PostJson("https://update-api.1c.ru/update-platform/programs/update/info", 
									ДанныеЗапроса, 
									ДополнительныеПараметры);
		
		Если ТипЗнч(Ответ) <> Тип("Соответствие") Тогда
			Результат.ТекстОшибки = "Некорректный формат ответа сервера.";
			УстановитьОтключениеБезопасногоРежима(Ложь);
			Возврат Результат;
		КонецЕсли;
		
		Ошибка = Ответ.Получить("error");
		Если Ошибка <> Неопределено Тогда
			Результат.ТекстОшибки = СформироватьТекстОшибкиAPI(Ответ);
			УстановитьОтключениеБезопасногоРежима(Ложь);
			Возврат Результат;
		КонецЕсли;
		
		Платформа = Ответ.Получить("platformUpdateResponse");
		Если Платформа = Неопределено Тогда
			Результат.ТекстОшибки = "Данные об обновлении платформы не получены.";
			УстановитьОтключениеБезопасногоРежима(Ложь);
			Возврат Результат;
		КонецЕсли;
		
		НоваяВерсия = Платформа.Получить("platformVersion");
		Если НоваяВерсия <> Неопределено Тогда
			Результат.НоваяВерсия = Строка(НоваяВерсия);
		КонецЕсли;
		
		URLИнфо = Платформа.Получить("transitionInfoUrl");
		Если URLИнфо <> Неопределено Тогда
			Результат.URLИнфо = СокрЛП(URLИнфо);
		КонецЕсли;
		
		Результат.Успех = Истина; 
		
	Исключение
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	УстановитьОтключениеБезопасногоРежима(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьЛогВерсииКонфигПлатформы(Уровень, ТекстСообщения)
	
	ЗаписьЖурналаРегистрации("СинхронизацияВерсийПлатформы1С", Уровень, , , ТекстСообщения);
	
КонецПроцедуры


Функция СформироватьТекстОшибкиAPI(Ответ)
	
	ТекстОшибки = "";
	
	Статус = Ответ.Получить("status");
	Если Статус <> Неопределено Тогда
		ТекстОшибки = "HTTP-код: " + Формат(Статус, "ЧГ=0") + ". ";
	КонецЕсли;
	
	Сообщение = Ответ.Получить("message");
	Если Сообщение <> Неопределено Тогда
		ТекстОшибки = ТекстОшибки + Сообщение;
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(ТекстОшибки), "Неизвестная ошибка сервиса.", ТекстОшибки);
	
КонецФункции

#КонецОбласти
